# 4.5 Data Wrangling and Subsetting

### Importing Libraries

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os

### Importing data sets

In [2]:
# Creating path variable
path = r'C:\Users\lisa_\02\2023 Instacart Basket Analysis'

In [3]:
#Importing products.csv data set from Original Data folder and orders_wrangled.csv data set from Prepared Data folder
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = 0)

## 4.5.1 Data Consistency Check for df_prods dataframe

In [4]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [5]:
df_prods[df_prods.prices == 99999]

       product_id           product_name  aisle_id  department_id   prices
33666       33664  2 % Reduced Fat  Milk        84             16  99999.0

In [6]:
df_prods.shape

(49693, 5)

### - Max value in prices column is 99999 which could be incorrect data or a placeholder for missing data.

### Check for mixed_type data

In [7]:
# Check for mixed-type data
for col in df_prods.columns.tolist():
  weird = (df_prods[[col]].applymap(type) != df_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods[weird]) > 0:
    print (col, 'mixed')
  else: print(col, 'NOT mixed')

product_id NOT mixed
product_name mixed
aisle_id NOT mixed
department_id NOT mixed
prices NOT mixed

### - There are no mixed-type data in df_prods dataframe.

### Check for missing values

In [8]:
# Finding missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [9]:
df_prods_nan = df_prods[df_prods['product_name'].isnull()==True]
df_prods_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [10]:
df_prods.shape

(49693, 5)

### Drop missing values

In [11]:
# Create a new dataframe dropping missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]
df_prods_clean

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [12]:
df_prods_clean.shape

(49677, 5)

### Check for duplicates

In [13]:
# Finding duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

### Addressing Duplicates

In [14]:
df_prods_clean.shape

(49677, 5)

In [15]:
# Create new dataframe dropping duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()
df_prods_clean_no_dups.shape

(49672, 5)

### Export clean data

In [16]:
# Export clean and no duplicates dataframe
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

## 4.5.2 Run the df.describe() function on your df_ords dataframe.

In [17]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [18]:
df_ords.shape

(3421083, 6)

## 4.5.3 Check for mixed-type data in your df_ords dataframe.

In [19]:
# Check for mixed-type data
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col, 'mixed')
  else: print(col, 'NOT mixed')

order_id NOT mixed
user_id NOT mixed
order_number NOT mixed
orders_day_of_week NOT mixed
order_hour_of_day NOT mixed
days_since_prior_order NOT mixed

## 4.5.4 If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

### - There are no mixed-type data in df_ords dataframe.

## 4.5.5 Run a check for missing values in your df_ords dataframe.

In [20]:
# Finding missing values
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [21]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull()==True]
df_ords_nan

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [22]:
df_ords[df_ords.order_number == 1]

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

### - The data shows that NaN is consistent to first orders from all users, which means there is no value for day_since_prior_order because this is technically their first order and therefore will have zero orders prior. It might be best to replace this value with 0 to indicate zero days since prior order or mark it as "first order".

## 4.5.6 Address the missing values using an appropriate method.

### - I thought it best to replace the NaN values in days_since_prior_order column with "0" to indicate zero days since prior order since this is the user's very first order and will have no orders prior to that.

In [23]:
#Replacing NaN with 0
df_ords_clean = df_ords['days_since_prior_order'] = df_ords['days_since_prior_order'].fillna(0)
df_ords_clean.isnull().sum()

0

In [24]:
df_ords_clean.isnull().sum()

0

In [25]:
df_ords[df_ords.order_number == 1]

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,0.0
11,2168274,2,1,2,11,0.0
26,1374495,3,1,1,14,0.0
39,3343014,4,1,6,11,0.0
45,2717275,5,1,3,12,0.0
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,0.0
3420934,3189322,206206,1,3,18,0.0
3421002,2166133,206207,1,6,19,0.0
3421019,2227043,206208,1,1,15,0.0
3421069,3154581,206209,1,3,11,0.0

## 4.5.7 Run a check for duplicate values in your df_ords data.

In [26]:
# Finding duplicates
df_ords = df_ords[df_ords.duplicated()]
df_ords.size

0

In [28]:
df_ords_clean.shape

(3421083,)

### - There are no duplicates in df_ords dataframe.

## 4.5.9 Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [27]:
# Export clean and no duplicates dataframe
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))